snlkuharlocal/src/Documents/ЛистМаркировкиОстатков/ЛистМаркировкиОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистМаркировкиОстатков</name>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКоробки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодКоробки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПолный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлочков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЛистМаркировки/ЛистМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистМаркировки</name>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОклейкаНеВыполнялась</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНаборы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокРаспечатанная</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПечати</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЛистМаркировкиОстатков/ManagerModule.bsl
Функция НайтиСоздатьЛистМаркировки (ДокОснование,ЛистНабора=Неопределено) экспорт
	// Кухарь А.Ю.  04.07.2024 начало
	возврат СоздатьЛистМаркировки(ДокОснование,ЛистНабора);	
	// Кухарь А.Ю.  04.07.2024 конец
	
	
	если ЛистНабора=Неопределено тогда
		ЛистНабора=документы.ЛистНабора.ПустаяСсылка();
	КонецЕсли;
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ЛистМаркировки.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ЛистМаркировки КАК ЛистМаркировки
	             |ГДЕ
	             |	ЛистМаркировки.ДокОснование = &ДокОснование
	             |	И ЛистМаркировки.Проведен
	             |	И ЛистМаркировки.ЛистНабора = &ЛистНабора";
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	запрос.УстановитьПараметр("ЛистНабора",ЛистНабора);
	выборка=запрос.Выполнить().Выбрать();
	если выборка.Количество()=0 тогда
		 возврат СоздатьЛистМаркировки(ДокОснование,ЛистНабора);
	 КонецЕсли;
	 
	пока выборка.Следующий() цикл
		возврат выборка.ссылка;
	КонецЦикла;
	
КонецФункции

Функция СоздатьЛистМаркировки (ДокОснование,ЛистНабора)
	ЛистМаркировки=Документы.ЛистМаркировки.СоздатьДокумент();
	ЛистМаркировки.ДокОснование=ДокОснование;
	ЛистМаркировки.ОбработкаЗаполнения(ДокОснование,"",Истина);
	ЛистМаркировки.ЛистНабора=ЛистНабора;
	
	// Кухарь А.Ю.  04.07.2024 начало
	// //ЛистМаркировки.Дата=ПолучитьРеквизитШапки(ЛистНабора,"Дата","Документ")-1;
	ЛистМаркировки.Дата=ТекущаяДатаСеанса();	 
	// Кухарь А.Ю.  04.07.2024 конец
	
	ЛистМаркировки.Записать();
	Возврат ЛистМаркировки.Ссылка;
КонецФункции
